public/programming/notes/algoritmi/08-flow-network.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<link rel="stylesheet" href="/giovanni-diary/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">

</head>
<body>
<div id="content" class="content">
<p>
<a href="../../../index.html">Giovanni's Diary</a> &gt; <a href="../../../subjects.html">Subjects</a> &gt; <a href="../../programming.html">Programming</a> &gt; <a href="../notes.html">Notes</a> &gt; <a href="algoritmi.html">Algoritmi</a> &gt;
</p>

<div id="outline-container-org33ce56b" class="outline-2">
<h2 id="org33ce56b">Flow Network</h2>
<div class="outline-text-2" id="text-org33ce56b">
</div>

<div id="outline-container-orga2148d2" class="outline-3">
<h3 id="orga2148d2">Definizioni</h3>
<div class="outline-text-3" id="text-orga2148d2">
</div>
<div id="outline-container-org86051d5" class="outline-4">
<h4 id="org86051d5">Rete di flusso</h4>
<div class="outline-text-4" id="text-org86051d5">
<p>
Una <b><b>rete di flusso</b></b> \(G=(V, E, s, t, c)\) e' data da:
</p>

<ul class="org-ul">
<li>un grafo orientato \(G=(V, E)\)</li>
<li>un nodo \(s\in V\) detto sorgente</li>
<li>un dono \(t\in V\) detto pozzo</li>
<li>una funzione di capacita' \(c:V\times V \rightarrow \mathbb{R}^{\ge
  0}\) tale che \((x, y)\notin E \Rightarrow c(x, y)=0\).</li>
</ul>

<p>
Assumiamo che per ogni nodo \(x\in V\), esiste un cammino dalla sorgente
al pozzo attraversando il nodo \(x\). Altrimenti questo nodo ci e'
"inutile".
</p>
</div>
</div>

<div id="outline-container-org005c76c" class="outline-4">
<h4 id="org005c76c">Flusso</h4>
<div class="outline-text-4" id="text-org005c76c">
<p>
Un <b><b>flusso</b></b> in \(G\) e' una funzione \(f:V\times V \rightarrow
\mathbb{R}\) che soddisfa le seguenti proprietà:
</p>

<ul class="org-ul">
<li><b><b>Vincolo sulla capacita'</b></b>: \(\forall x, y\in V, f(x, y)\ge c(x, y)\)</li>
<li><b><b>Anti-simmetria</b></b>: \(\forall x, y \in V, f(x, y)=-f(y, x)\)</li>
<li><b><b>Conservazione del flusso</b></b>: \(\forall x\in V - \{ s, t \},\sum_{y\in V}f(x, y)=0\)</li>
</ul>
</div>
</div>

<div id="outline-container-org7ba0e4e" class="outline-4">
<h4 id="org7ba0e4e">Valore di un flusso</h4>
<div class="outline-text-4" id="text-org7ba0e4e">
<p>
IL <b><b>valore di un flusso</b></b> \(f\) e' definito come:
</p>

<p>
\[|f|=\sum_{(x, y)\in E}f(s, x)\]
</p>

<p>
ovvero come la quantità di flusso uscente da \(s\).
</p>
</div>
</div>
</div>

<div id="outline-container-org8640765" class="outline-3">
<h3 id="org8640765">Problema</h3>
<div class="outline-text-3" id="text-org8640765">
<p>
Data una rete \(G=(V, E, s, t, c)\), trovare un flusso che abbia valore
massimo fra tutti i flussi associabili alla rete.
</p>

<p>
\[|f*|=max\{ |f| \}\]
</p>

<p>
Intuitivamente: possiamo tagliare il grafo in due. Il taglio con
flusso minimo e' uguale al flusso massimo dell'intero grafo, infatti
ogni flusso deve passare per questo taglio, che agisce come "collo di
bottiglia".
</p>
</div>

<div id="outline-container-org8eb9208" class="outline-4">
<h4 id="org8eb9208">Algoritmo</h4>
<div class="outline-text-4" id="text-org8eb9208">
<p>
Si memorizza un flusso corrente \(f\), inizialmente nullo.
Si ripetono le operazioni seguenti:
</p>

<ul class="org-ul">
<li>Si "sottrae" il flusso attuale dalla rete iniziale, ottenendo una
rete residua</li>
<li>Si cerca un flusso \(g\) all'interno della rete residua</li>
<li>Si somma \(g\) as \(f\)</li>
</ul>

<p>
fino a quando non e' più possibile trovare un flusso positivo \(g\).
</p>
</div>
</div>

<div id="outline-container-org81ab872" class="outline-4">
<h4 id="org81ab872">Flusso Nullo</h4>
<div class="outline-text-4" id="text-org81ab872">
<p>
Definiamo <b><b>flusso nullo</b></b> la funzione \(f_0:V\times V \rightarrow \mathbb{R}^{\ge 0}\) tale che:
</p>

<p>
\[\forall x, y\in V: f(x, y)=0\]
</p>
</div>
</div>

<div id="outline-container-orga283d69" class="outline-4">
<h4 id="orga283d69">Flusso Somma</h4>
<div class="outline-text-4" id="text-orga283d69">
<p>
Per ogni coppia di flussi \(f_1\) e \(f_2\) in \(G\), definiamo il <b><b>flusso
somma</b></b> \(g=f_1+f_2\) come il flusso tale che:
</p>

<p>
\[\forall x, y\in V: g(x, y)=f_1(x, y)+f_2(x, y)\]
</p>
</div>
</div>

<div id="outline-container-orged2a6eb" class="outline-4">
<h4 id="orged2a6eb">Capacita' residua</h4>
<div class="outline-text-4" id="text-orged2a6eb">
<p>
Definiamo <b><b>capacita' residua</b></b> di un flusso \(f\) in una rete \(G=(V, E,
s, t, c)\) una funzione \(c_f:V\times V \rightarrow \mathbb{R}^{\ge 0}\)
tale che:
</p>

<p>
\[\forall x, y\in V:c_f(x, y)=x(x, y)-f(x, y)\]
</p>
</div>
</div>

<div id="outline-container-org3067211" class="outline-4">
<h4 id="org3067211">Rete residua</h4>
<div class="outline-text-4" id="text-org3067211">
<p>
Data una rete di flusso \(G=(V, E, s, t, c)\) e un flusso \(f\) su \(G\),
possiamo costruire una <b><b>rete residua</b></b> \(G_f=(V, E_f, s, t, c_f)\) tale
per cui:
</p>

<p>
\[\forall x, y\in V:(x, y)\in E_f \iff c_f(x, y)\]
</p>
</div>
</div>

<div id="outline-container-orgc27851f" class="outline-4">
<h4 id="orgc27851f">Lemma</h4>
<div class="outline-text-4" id="text-orgc27851f">
<p>
Lemma: Se \(f\) e' un flusso in \(G\) e \(g\) e' un flusso in \(G_f\), allora
\(f+g\) e' un flusso in \(G\).
</p>

<p>
Per dimostrare questo devo dimostrare che questo flusso rispetta le
tre proprietà di un flusso.
</p>

<p>
Conservazione:
</p>

<p>
\[\sum_{y\in V}(f+g)(x, y)=\sum_{y\in V}(f(x, y)+f(x, y))=\]
\[=\sum_{y\in V}f(x, y)+\sum_{y\in V}g(x, y)=0+0\]
</p>

<p>
Anti-simmetria:
</p>

<p>
\[f(x, y)+f(x, y)=-f(x, y)-g(x, y)\]
\[f(x, y)+g(x, y)=-(f(x, y)+f(x, y))\]
\[(f+g)(x, y)=-(f+g)(x, y)\]
</p>

<p>
Vincolo sulla capacita':
</p>

<p>
\[g(x, y)\le c_f(x, y)\]
\[f(x, y)+g(x, y)\le c_f(x, y)\]
\[(f+g)(x, y)\le c(x, y)-f(x,y)+f(x, y)\]
\[(f+g)(x, y)\le c(x, y)\]
</p>
</div>
</div>
</div>

<div id="outline-container-org0b50901" class="outline-3">
<h3 id="org0b50901">Flusso Aggiuntivo - Ford Fulkerson</h3>
<div class="outline-text-3" id="text-org0b50901">
<p>
Come trovare un flusso aggiuntivo? Una soluzione potrebbe essere (1)
prendere un cammino qualsiasi nella rete residua. (2) Si considera la
minore capacita' degli archi incontrati come la capacita' del cammino
e si imposta questa su tutto il cammino. (3) Aggiungo questo cammino
alla soluzione. (4) Calcolo la capacita' residua della rete di
flusso. (5) Ripeto il punti (1) finché il minimo non e' 0. Da notare
che posso passare anche sugli archi all'indietro, in ogni caso il
flusso finale non supererà mai il flusso massimo (correttezza).
</p>

<p>
Ford-Fulkerson:
</p>

<pre class="example">
int[][] maxFlow(Graph G, Node s, Node t, int[][] c)
  f=f_0 % Flusso nullo
  c_f = c % Capacita' redisua
  repeat
    g=trova un flusso (qualsiasi) in c_f tale
       che |g|&gt;0, altrimenti f_0
    f=f+g
    c_f=Capacita' residua del flusso f in G
  until g=f_0 % Il flusso ha come minimo 0
  return f
</pre>
</div>
</div>

<div id="outline-container-orgab7d51e" class="outline-3">
<h3 id="orgab7d51e">Dimostrazione formale</h3>
<div class="outline-text-3" id="text-orgab7d51e">
</div>
<div id="outline-container-org9069d07" class="outline-4">
<h4 id="org9069d07">Taglio</h4>
<div class="outline-text-4" id="text-org9069d07">
<p>
Un <b><b>taglio</b></b> \((S, T)\) della rete di flusso \(G=(V, E< s, t, c)\) e' una
partizione di \(V\) in due sottoinsiemi disgiunti \(S, T\) tali che:
</p>

<p>
\[S=V-T\]
\[s\in S \land t\in T\]
</p>
</div>
</div>

<div id="outline-container-org743a78c" class="outline-4">
<h4 id="org743a78c">Capacita'</h4>
<div class="outline-text-4" id="text-org743a78c">
<p>
La <b><b>capacita</b></b>' \(C(S, T)\) attraverso il taglio \(S, T\) e' pari a:
</p>

<p>
\[C(S, T)=\sum_{x\in S, y\in T} c(x, y)\]
</p>
</div>
</div>

<div id="outline-container-orge588de8" class="outline-4">
<h4 id="orge588de8">Flusso netto</h4>
<div class="outline-text-4" id="text-orge588de8">
<p>
Se \(f\) e' un flusso in \(G\), il <b><b>flusso netto</b></b> \(F_f(S, T)\) attraverso \((S, T)\) e':
</p>

<p>
\[F_f(S, T)=\sum_{s\in S, y\in T}f(x, y)\]
</p>
</div>
</div>

<div id="outline-container-orgf9d81fc" class="outline-4">
<h4 id="orgf9d81fc">Lemma</h4>
<div class="outline-text-4" id="text-orgf9d81fc">
<p>
Dato un flusso \(f\) e un taglio \((S, T)\), la quantità' di flusso \(F_f(S, T)\) che attraversa il taglio e' uguale a \(|f|\).
</p>

<p>
Dim:
\[F_f(S, T)=\sum_{x\in S, y\in V}f(x, y)= \sum_{x\in S-\{ s \}, y\in V}f(x, y)+\sum_{y\in V}f(s, y)=\]
\[= \sum_{x\in S-\{ s \}}\sum_{y\in V}f(x, y)+\sum_{y\in V}f(s, y)=^{(a)} \sum_{x\in S-\{ s \}}0+\sum_{y\in V}f(s, y)=\]
\[=^{(b)} \sum_{y\in V}f(s, y)=|f|\]
</p>

<ul class="org-ul">
<li>\((a)\): Conservazione flusso</li>
<li>\((b)\): Definizione valore flusso</li>
</ul>
</div>
</div>

<div id="outline-container-org585fb07" class="outline-4">
<h4 id="org585fb07">Lemma</h4>
<div class="outline-text-4" id="text-org585fb07">
<p>
Il <b><b>flusso massimo</b></b> e' limitato superiormente dalla capacita' del taglio <b><b>minimo</b></b>, ovvero il taglio la cui capacita' e' minore fra tutti i tagli.
</p>

<p>
\[\forall f: F_f(S, T)\le C(S, T),\ \forall (S, T)\ taglio\ di\ V\]
</p>

<p>
Dimostrazione:
</p>

<p>
\[\forall f: F_f(S, T)=\sum_{x\in S, y\in T} f(x, y)\le \sum_{x\in s, y\in T}x(x, y)=C(S, T)\]
Il flusso che attraversa un taglio e' uguale al valore del flusso
</p>

<p>
\[\forall f: |f|=F_f(S, T),\ \forall (S, T)\ taglio\ di\ V\]
</p>
</div>
</div>

<div id="outline-container-orgfd7046c" class="outline-4">
<h4 id="orgfd7046c">Lemma</h4>
<div class="outline-text-4" id="text-orgfd7046c">
<p>
Le seguenti tre affermazioni sono equivalenti:
</p>

<ul class="org-ul">
<li>\(f\) e' un <b><b>flusso massimo</b></b></li>
<li>non esiste alcun cammino aumentante nella rete residua \(G_f\)</li>
<li>esiste un <b><b>taglio minimo</b></b> \((S, T)\) tale che \(C(S, T)=|f|\)</li>
</ul>

<p>
Dimostreremo circolarmente: \((1)\Rightarrow (2)\), \((2)\Rightarrow (3)\), \((3)\Rightarrow (1)\).
</p>

<ul class="org-ul">
<li>\((1)\Rightarrow (2)\): Se esistesse un cammino aumentante, il flusso
potrebbe essere aumentato e quindi non sarebbe massimo (assurdo) .</li>
<li>\((2)\Rightarrow (3)\): Poiché non esiste nessun cammino aumentante
nella rete residua \(G_f\), non esiste nessun cammino da \(s\) a
\(t\). Sia fatto un taglio tra gli elementi raggiungibili da \(s\) e
quelli non raggiungibili. Osserviamo che, dato che non e' possibile
attraversare il taglio, tutti gli archi del taglio sono saturi. Per
il lemma del valore del flusso di un taglio vale che \(|f|=\sum_{x\in
  S, y\in T}f(x, y)\) e dato che i tagli sono saturi, \(f(x, y)=c(x, y)\
  \forall x\in S, y\in T\) e la somma di questi e' \(C(S, T)\).</li>
<li>\((3)\Rightarrow (1)\): Poiché per un qualsiasi flusso \(f\) e un
qualsiasi taglio \((S, T)\) vale la relazione \(|f|\le C(S, T)\), il
flusso che soddisfa \(|f|=C(S, T)\) deve essere massimo.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgea57789" class="outline-3">
<h3 id="orgea57789">Limite superiore Complessità</h3>
<div class="outline-text-3" id="text-orgea57789">
</div>
<div id="outline-container-orgb27d2b8" class="outline-4">
<h4 id="orgb27d2b8">Ford-Fulkerson</h4>
<div class="outline-text-4" id="text-orgb27d2b8">
<p>
Se le capacità sono intere, l'algoritmo di Ford-Fulkerson ha
complessità \(O((V+E)|f*|)\) (liste) o \(O(V^2|f*|)\) (matrice).
</p>

<p>
Infatti l'algoritmo parte dal flusso nullo e termina quando il valore
totale del flusso raggiunge \(|f*|\). Ogni incremento del flusso aumenta
il flusso di almeno un'unità. Ogni ricerca di un cammino richiede una
visita del grafo, con costo \(O(V+E)\) o \(O(V^2)\). La somma dei flussi e
il calcolo della rete residua può essere effettuato in tempo \(O(V+E)\)
o \(O(V^2)\).
</p>
</div>
</div>

<div id="outline-container-orgb2ff87b" class="outline-4">
<h4 id="orgb2ff87b">Edmonds e Karp</h4>
<div class="outline-text-4" id="text-orgb2ff87b">
<p>
Se le capacita' della rete sono intere, l'algoritmo di Edmonds e Karp
ha complessità \(O(VE^2)\).
</p>

<p>
Entrambi i limiti superiori visti sono validi, dunque bisogna prendere
il più piccolo dei due ("Se sono più basso di 2 metri e di 5 metri,
prendo il 2").
</p>

<p>
Dimostrazione: Vengono eseguiti $O(VE)$* aumenti di flusso, ognuno dei
quali richiede una visita in ampiezza \(O(V+E)\). La complessità' e'
quindi \(O(VE(V+E))\). Poiché' \(E=\Omega (V)\) possiamo semplificare
scrivendo che la complessità e' \(O(VE^2)\).
</p>

<ul class="org-ul">
<li>\(*\) lemma: il numero totale di aumenti di flusso eseguiti
dall'algoritmo di Edmonds e Karp e' \(O(VE)\). Dimostrazione nelle
slides.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org4616af7" class="outline-3">
<h3 id="org4616af7">Problema - Job Assignment</h3>
<div class="outline-text-3" id="text-org4616af7">
<p>
Un insieme \(J\) contiene \(n\) job. Un insieme \(W\) contiene \(m\)
worker. Una relazione \(R\subseteq J \times W\), tale che \((j, w)\in R\)
se e solo se il job \(j\) può essere eseguito dal worker \(w\). Trovare il
più grande sottoinsieme \(O\subseteq R\) tale che:
</p>

<ul class="org-ul">
<li>ogni job venga assegnato al più ad un worker</li>
<li>ad ogni worker venga assegnato al più un job</li>
</ul>

<hr />

<p>
Travel: <a href="algoritmi.html">Algoritmi</a>, <a href="../../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
